BusinessProcesses/ПоступлениеИПроверкаЗаявкиНаПриобретениеПаев.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<BusinessProcess>
		<Properties>
			<Name>ПоступлениеИПроверкаЗаявкиНаПриобретениеПаев</Name>
			<Task>Task.ЗадачаИсполнителя</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пайщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СканПаспортаПайщикаПроверен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

InformationRegisters/СтатусыЗаявокНаПриобретениеПаев.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтатусыЗаявокНаПриобретениеПаев</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявокПайщиков</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаявкаПайщика</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

BusinessProcesses/ПоступлениеИПроверкаЗаявкиНаПриобретениеПаев/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	// Заполняем только на основании заявок на приобретение паев	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаПайщика") Тогда
		
		ЭтотОбъект.Основание	= ДанныеЗаполнения;
		ЭтотОбъект.Дата 		= ТекущаяДата();
		
		РеквизитыОснования		= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, "Организация, Пайщик");
		ЭтотОбъект.Организация	= РеквизитыОснования.Организация;
		ЭтотОбъект.Пайщик		= РеквизитыОснования.Пайщик;
		
	КонецЕсли;
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);

КонецПроцедуры

Процедура ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, ИмяГруппыИсполнителей)
		
	ГруппаИсполнителей = Справочники.ГруппыПользователей.ПолучитьГруппуИсполнителей(ОбщегоНазначения.ПолучитьИменованныйОбъект(ИмяГруппыИсполнителей), ЭтотОбъект.Организация);
		
	Для Каждого Задача Из ФормируемыеЗадачи Цикл		
		
		Задача.ГруппаИсполнителей = ГруппаИсполнителей;
		Задача.Основание 		  = ЭтотОбъект.Основание;
		Задача.Организация		  = ЭтотОбъект.Организация;
		
		//Если Задача.ТочкаМаршрута = БизнесПроцессы.ПоступлениеИПроверкаЗаявкиНаПриобретениеПаев.ТочкиМаршрута.ФормированиеЗаявкиПайщика Тогда
		//	
		//	Задача.ТекстЗадачи = "";
		//	
		//	// Проверяем наличие заявки - тогда задачу выполняем автоматически
		//	Если ТипЗнч(Задача.Основание) = Тип("ДокументСсылка.ЗаявкаПайщика") И ЗначениеЗаполнено(Задача.Основание) Тогда
		//		Задача.ДополнительныеСвойства.Вставить("АвтоматическоеВыполнениеЗадачи", Истина);
		//	КонецЕсли;
			
		Если Задача.ТочкаМаршрута = БизнесПроцессы.ПоступлениеИПроверкаЗаявкиНаПриобретениеПаев.ТочкиМаршрута.ПроверкаСканаПаспорта Тогда
			
			Задача.ТекстЗадачи = СтрШаблон("Проверить скан паспорта пайщика %1. Если проверка пройдена, при выполнении задачи установить флажок %2",
				ЭтотОбъект.Пайщик, "'Скан паспорта пайщика проверен'");
				
		ИначеЕсли Задача.ТочкаМаршрута = БизнесПроцессы.ПоступлениеИПроверкаЗаявкиНаПриобретениеПаев.ТочкиМаршрута.УточнениеВопросовПоПроверкеСканаПаспорта Тогда
			
			Задача.ТекстЗадачи = СтрШаблон("Уточнить вопросы по проверке скана паспорта пайщика %1", ЭтотОбъект.Пайщик);
			
		КонецЕсли;
				
	КонецЦикла;
	
				
КонецПроцедуры

Процедура ЭтоНовыйКлиентПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	// Если у пайщика отсутствуют анкетные данные, это новый клиент	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо КАК ЮрФизЛицо
		|ИЗ
		|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|				И ЮрФизЛицо = &Пайщик
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних");
	
	Запрос.УстановитьПараметр("Организация",	ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Пайщик",			ЭтотОбъект.Пайщик);
	Запрос.УстановитьПараметр("Дата",			ТекущаяДатаСеанса());
	
	Результат = Запрос.Выполнить().Пустой();
	
КонецПроцедуры

Процедура ПроверкаСканаПаспортаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "КлиентскийОтдел");
	
КонецПроцедуры

Процедура ПроверкаСканаПаспортаПройденаПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
    Результат = ЭтотОбъект.СканПаспортаПайщикаПроверен;	
	
КонецПроцедуры

Процедура ПроверкаСканаПаспортаПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	ЭтотОбъект.СканПаспортаПайщикаПроверен = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Задача, "СканПаспортаПайщикаПроверен");
	
	Если ЭтотОбъект.СканПаспортаПайщикаПроверен Тогда
		
		РегистрыСведений.СтатусыЗаявокНаПриобретениеПаев.УстановитьСтатусЗаявкиНаПриобретениеПаев(
									ЭтотОбъект.Организация,
									ЭтотОбъект.Основание,
									Перечисления.СтатусыЗаявокПайщиков.Принята,
									ТекущаяДатаСеанса(),
									Отказ);
									
	КонецЕсли;
								
КонецПроцедуры  

Процедура УточнениеВопросовПоПроверкеСканаПаспортаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "КлиентскийОтдел");
	
КонецПроцедуры

Процедура ОтправкаПакетаЗаявкиВДКПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	РаботаСБизнесПроцессамиИЗадачами.ВыполнитьОбменСДКРегион(
	    "Выгрузка",
	    Отказ,
		ЭтотОбъект.Организация,
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Задача, "Основание.Дата"),
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Основание, "ПаевойИнвестиционныйФонд"),
		Задача);
	
КонецПроцедуры

Процедура ОтправкаВЛККСтатусаЗаявкаПринятаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "СистемныеПользователи");
	
КонецПроцедуры

Процедура ОтправкаПакетаЗаявкиВДКПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "СистемныеПользователи");
	
КонецПроцедуры

Процедура ТребуетсяОткрытиеЛицевогоСчетаПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Основание, "ОткрытьЗакрытьДепозитарныйСчет");
	
КонецПроцедуры

Процедура ЗагрузкаНовогоЛицевогоСчетаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ЗаполнитьРеквизитыЗадачи(ФормируемыеЗадачи, "СистемныеПользователи");
	
КонецПроцедуры

Процедура ЗагрузкаНовогоЛицевогоСчетаПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	РаботаСБизнесПроцессамиИЗадачами.ВыполнитьОбменСДКРегион(
	    "Загрузка",
	    Отказ,
		ЭтотОбъект.Организация,
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Задача, "Основание.Дата"),
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Основание, "ПаевойИнвестиционныйФонд"),
		Задача);

КонецПроцедуры

Процедура ОтправкаВЛККСтатусаЗаявкаПринятаПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)

	ОбменСЛКК = Обработки.ОбменДаннымиСЛККЕСИАФинанс.Создать(); 
	
	ОбменСЛКК.Организация = ЭтотОбъект.Организация;
	
	ОбменСЛКК.ДополнительныеСвойства.Вставить("Источник", ЭтотОбъект.Ссылка);
	ОбменСЛКК.УстановитьСтатус(ЭтотОбъект.Основание, "in_process", Отказ);
	
КонецПроцедуры
